Same problem with `cloudflare_workers_script` resource.

```
  # cloudflare_workers_script.example must be replaced
-/+ resource "cloudflare_workers_script" "example" {
      ~ bindings            = [
          ~ {
                name = "MY_ENV_VAR"
              ~ text = "my_data" -> "my_data2"
                # (1 unchanged attribute hidden)
            },
        ]
      + created_on          = (known after apply)
      + etag                = (known after apply)
      + has_assets          = (known after apply)
      + has_modules         = (known after apply)
      ~ id                  = "omtest" # forces replacement -> (known after apply) # forces replacement
      ~ logpush             = false -> (known after apply)
      + migrations          = (known after apply)
      + modified_on         = (known after apply)
      + observability       = (known after apply)
      + placement           = (known after apply)
      + startup_time_ms     = (known after apply)
      ~ tail_consumers      = [] -> (known after apply)
      ~ usage_model         = "standard" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```